app/controllers/api/cards_controller.rb

INSERT INTO "cards" ("side_a", "side_b", "deck_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["side_a", "horse"], ["side_b", "cheval"], ["deck_id", 1], ["created_at", 2017-03-15 22:55:02 UTC], ["updated_at", 2017-03-15 22:55:02 UTC]]
---
  def create
    @card = Card.new(card_params)
    if @card.save

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cards" SET "side_b" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["side_b", "specially updated answer here."], ["updated_at", 2017-03-21 17:48:33 UTC], ["id", 3]]
---
  def update
    @card = Card.find(params[:id])
    if @card.update(card_params)

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 7]]
---
  def destroy
    @card = Card.find(params[:id])
    @card.destroy