app/controllers/api/decks_controller.rb

SELECT "decks".* FROM "decks" WHERE "decks"."author_id" = $1  [["author_id", 1]]
---
  def index
    if params[:recent]
      num = params[:recent][:num].to_i || 10
      offset = params[:recent][:offset].to_i || 0
      @decks = Deck.most_recent(num, offset)
    elsif params[:authorId]
      @decks = Deck.authored_by(params[:authorId].to_i, current_user.id)
    else
      @decks = Deck.all

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = 2
UPDATE "decks" SET "updated_at" = '2017-03-17 17:12:40.744655' WHERE "decks"."id" = $1  [["id", 4]]
---
  def show
    @deck = Deck.includes(:cards).find(params[:id])
    if @deck
      @deck.touch

INSERT INTO "decks" ("title", "description", "author_id", "created_at", "updated_at", "category") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Dogs"], ["description", "dogs I have loved"], ["author_id", 1], ["created_at", 2017-03-16 23:01:44 UTC], ["updated_at", 2017-03-16 23:01:44 UTC], ["category", "miscellaneous"]]
---
  def create
    @deck = Deck.new(deck_params)
    @deck.author_id = current_user.id
    if @deck.save

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "decks" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "decks"."id" = $4  [["title", "Colors and Shapes"], ["description", ""], ["updated_at", 2017-03-21 18:21:43 UTC], ["id", 3]]
---
  def update
    @deck = Deck.find(params[:id])
    if @deck.update(deck_params)

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "decks" WHERE "decks"."id" = $1  [["id", 5]]
---
  def destroy
    @deck = Deck.find(params[:id])
    @deck.destroy