app/views/api/decks/show.json.jbuilder

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = 1
---
json.set! :cards do
  @deck.cards.each do |card|